## Plans :heavy_check_mark:

<details>
  <summary><h2>Terrateam Plan Output :heavy_check_mark:</h2></summary>

**Dir**: .
**Workspace**: default
**Success**: :heavy_check_mark:

```diff

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.example_aws.module.batch.aws_batch_compute_environment.this["fargate_spot"] has changed
!   resource "aws_batch_compute_environment" "this" {
        id                       = "example-scheduled-jobs-fargate_spot"
        tags                     = {
            "compute_environments" = "fargate_spot"
            "module"               = "batch"
        }
        # (9 unchanged attributes hidden)

!       compute_resources {
+           instance_type      = []
+           tags               = {}
            # (7 unchanged attributes hidden)
        }
    }

  # module.example_aws.module.batch.aws_batch_job_definition.this["example"] has changed
!   resource "aws_batch_job_definition" "this" {
        id                    = "arn:aws:batch:us-east-1:376942697097:job-definition/example-scheduled-jobs-example:1"
        name                  = "example-scheduled-jobs-example"
+       parameters            = {}
        tags                  = {
            "job_definitions" = "example"
            "module"          = "batch"
        }
        # (7 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.example_aws.module.eventbridge.aws_iam_policy.additional_json[0] will be created
+   resource "aws_iam_policy" "additional_json" {
+       arn       = (known after apply)
+       id        = (known after apply)
+       name      = "example-scheduled-jobs-eventbridge"
+       path      = "/"
+       policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action   = [
+                           "batch:SubmitJob",
                        ]
+                       Effect   = "Allow"
+                       Resource = "*"
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       policy_id = (known after apply)
+       tags_all  = {
+           "managed-by" = "Terraform"
+           "workspace"  = "terraform-example_scheduled_jobs-dev_dex4er"
        }
    }

  # module.example_aws.module.eventbridge.aws_iam_policy_attachment.additional_json[0] will be created
+   resource "aws_iam_policy_attachment" "additional_json" {
+       id         = (known after apply)
+       name       = "example-scheduled-jobs-eventbridge"
+       policy_arn = (known after apply)
+       roles      = [
+           "example-scheduled-jobs-eventbridge",
        ]
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 76.65 | 76.65 | 0.00|
| | **Total** | **76.65** | **76.65** | **0.00** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>

